def replace_name(df):
    df["수탁품"] = df["수탁품"].replace({
        "척빽립": "BBQ탕갈비",
        "백립": "탕갈비",
        "다리살": "닭장각정육",
        "닭정육": "닭장각정육",
        "갈매기살": "돈갈매기",
        "돈등심": "돈등잡",
        "목뼈": "돈목뼈",
        "목잡": "돈목살",
        "학본": "뼈우건",
        "뒷사태": "사태(뒤)",
        "앞사태": "사태(앞)",
        "꽃갈비": "소갈비",
        "갈비": "소갈비",
        "설도개별": "설도(개별)",
        "돈가부리": "돈가브리",
        "부채": "부채살",
        "부채(냉장)": "부채살",
        "삶은곱창(믹스)": "작업삶은곱창",
        "살치(냉장)": "살치살",
        "안창": "안창살",
        "갈비토시살": "토시살",
        "알전각": "앞다리",
        "차돌양지": "양지",
        "차돌백이": "차돌박이",
        "스지": "우건",
        "전각": "일반전각",
        "척갈비화": "척갈비",
        "등갈비": "탕갈비", # 등갈비 하나가 탕갈비, 미티탕갈비로 나뉨
        "빽립": "탕갈비",
        "미티빽립": "탕갈비(MEATY)",
        "미티탕갈비": "탕갈비(MEATY)",
        "닭정육": "닭장각정육",
        "닭다리살": "닭장각정육",
        "닭다리정육": "닭장각정육",
        "돈삼겹": "삼겹",
        "돈목뼈(16.00KG)": "돈목뼈",
        "돈목잡": "돈목살",
        "돈항정": "항정살",
        "정육": "닭장각정육",
        "살치": "살치살",
        "토시": "살치살",
        "우목심GFYG": "목심",
        "건": "우건",
        # "등갈비": "탕갈비(MEATY)",
        "토시": "토시살",
        # "생칵테일새우 26-30/9KG":
        # "생칵테일새우 31-40/9KG":
        # "생칵테일새우 31-40/9KG":
        # "생칵테일새우 41-50 9KG":
    })
    df["브랜드"] = df["브랜드"].replace({
        "G/H": "GREENHAM",
        "S/F": "SMITHFIELD",
        "SF": "SMITHFIELD",
        "P/D": "PERDIGAO",
        "SOUTHERN": "MIDFIELD",
        "SADIA_9_1044575": "SADIA",
        "SADIASIF": "SADIA",
        "SEARASIF": "SEARA",
        "PROTEINAANIMAI": "PROAN",
        "SWIFT_S/C": "5STAR",
        "EX": "EXCEL",
        "놀란": "NOLAN",
        "EXCEL/CA": "EXCEL",
        "SMITH/FL": "SMITHFIELD"

    })
    df["등급"] = df["등급"].replace({
        "CHAN": "UN",
        "GF/YG": "GF",
        "XT": "UN",
        "ANGUS_CH": "RRA",
        "SIF": "",
        "M": "",
        "gf": "GF"

    })
    df["ESTNO"] = df["ESTNO"].replace({
        "06-06": "06",
        "1": "",
        "SE3D": "3D",
        "UN3D": "3D",
        "562-348979": "562",
        "CH86M": "86M",
        "SE562M": "562M",
        "UN969G": "969G",
        "CH1311": "1311",
        "UN969": "969",
        "CH86R": "86R",
        "16208724": "1620",

    })
    return df