def replace_name(df):
    df["수탁품"] = df["수탁품"].replace({
        "척빽립": "BBQ탕갈비",
        "다리살": "닭장각정육",
        "닭정육": "닭장각정육",
        "갈매기살": "돈갈매기",
        "등심": "돈등잡",
        "목뼈": "돈목뼈",
        "목잡": "돈목살",
        "학본": "뼈우건",
        "뒷사태": "사태(뒤)",
        "앞사태": "사태(앞)",
        "꽃갈비": "소갈비",
        "설도개별": "설도(개별)",
        "안창": "안창살",
        "알전각": "앞다리",
        "차돌양지": "양지",
        "스지": "우건",
        "전각": "일반전각",
        "척갈비화": "척갈비",
        "등갈비": "탕갈비", # 등갈비 하나가 탕갈비, 미티탕갈비로 나뉨
        "빽립": "탕갈비",
        "미티빽립": "탕갈비(MEATY)",
        "미티탕갈비": "탕갈비(MEATY)",
        # "등갈비": "탕갈비(MEATY)",
        "토시": "토시살"
    })
    df["브랜드"] = df["브랜드"].replace({
        "G/H": "GREENHAM",
        "S/F": "SMITHFIELD",
        "P/D": "PERDIGAO"
    })
    df["ESTNO"] = df["ESTNO"].replace({
        "06-06": "06"
    })
    return df